app/controllers/documentary_films_controller.rb

SELECT "documentary_films".* FROM "documentary_films"
---
  def index
    @documentary_films = DocumentaryFilm.all

INSERT INTO "documentary_films" ("name", "synopsis", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "cachate "], ["synopsis", "logre que funcionara "], ["director", "esta funcionandooooooo "], ["created_at", "2023-08-08 02:57:03.190851"], ["updated_at", "2023-08-08 02:57:03.190851"]]
---
  def create
    @documentary_film = DocumentaryFilm.new(documentary_film_params)
    if @documentary_film.save